app/Views/layout/main.php

use App\Models\Modelkonfigurasi;

$this->konfigurasi = new Modelkonfigurasi();
$konfigurasi = $this->konfigurasi->orderBy('konfigurasi_id')->first();
---
SELECT *
FROM `konfigurasi`
ORDER BY `konfigurasi_id`
 LIMIT 1