app/Controllers/Nilai.php

    public function getnilai()
    {
        $model = new Modelnilai();
        $data = $model->getAllNilai();
        $i = 1;

        // Format data untuk DataTables
        $hasil = [
            "draw" => intval($this->request->getPost('draw')),
            "recordsTotal" => $model->countAll(),
            "recordsFiltered" => $model->countAll(),
---
SELECT COUNT(*) AS `numrows` FROM `nilai`

    public function getNilaiById()
    {
        // Mendapatkan nilai_id dari permintaan AJAX
        $model = new Modelnilai();
        $nilai_id = $this->request->getPost('nilai_id');

        log_message('debug', 'nilai_id: ' . $nilai_id);

        // Cari data berdasarkan nilai_id
        $data = $model->find($nilai_id);
---
SELECT *
FROM `nilai`
WHERE `nilai`.`nilai_id` = '38'