app/Models/Modelnilai.php

    public function getAllNilai()
    {
        return $this->findAll(); // Mengembalikan semua data dari tabel 'nilai'
---
SELECT *
FROM `nilai`